tylertms/dspic33e-sim/conformance/sfr_access.c
    cpu->data[0x0a9cu] = 0xa5u;
    cpu->data[0x0a9du] = 0x5au;
    copy_initialized = dspic33_initialize(&copy);
    inspect_map_condition(&census, copy_initialized, 0x0a9cu, "copy-initialize");
    census.lifecycle_checks++;
    if (copy_initialized) {
        inspect_map_condition(&census, dspic33_copy(&copy, cpu), 0x0a9cu, "copy-state");
        inspect_map_condition(&census, dspic33_read_word(&copy, 0x0a9cu) == 0u, 0x0a9cu,
                              "copy-read");
        census.lifecycle_checks += 2u;
        dspic33_destroy(&copy);
    }
    dspic33_reset(cpu, 0u);
    inspect_map_condition(&census, dspic33_read_word(cpu, 0x0a9cu) == 0u, 0x0a9cu,
                          "reset-read");
    dspic33_write_word(cpu, 0x0a9cu, 0xffffu);
    inspect_map_condition(&census, dspic33_read_word(cpu, 0x0a9cu) == 0u, 0x0a9cu,
                          "reset-write");
    census.lifecycle_checks += 2u;
    return census;
}

static uint32_t bit_count(uint16_t value) {
    uint32_t count = 0u;
    while (value != 0u) {
        count += value & 1u;
        value >>= 1u;
    }
    return count;
}

static bool access_is_unresolved(const SfrAccessDifference* difference) {
    return difference->normal != 0u || difference->read_only != 0u ||
           difference->reserved != 0u || difference->write_only != 0u;
}

static void select_register(Dspic33* cpu, uint16_t selector_address,
                            uint16_t selector_mask, uint16_t selector_value) {
    uint16_t selector = dspic33_read_word(cpu, selector_address);
    selector =
        (uint16_t)((selector & ~selector_mask) | (selector_value & selector_mask));
    dspic33_write_word(cpu, selector_address, selector);
}

static void prepare_register(Dspic33* cpu, uint16_t selector_address,
                             uint16_t selector_mask, uint16_t selector_value) {
    dspic33_reset(cpu, 0u);
    if (selector_mask != 0u) {
        select_register(cpu, selector_address, selector_mask, selector_value);
    }
}

static SfrAccessDifference inspect_access(
    Dspic33* cpu, uint16_t address, uint16_t normal_mask, uint16_t read_only_mask,
    uint16_t reserved_mask, uint16_t write_only_mask, uint16_t dependent_read_only_mask,
    uint16_t selector_address, uint16_t selector_mask, uint16_t selector_value) {
    SfrAccessDifference difference;
    prepare_register(cpu, selector_address, selector_mask, selector_value);
    difference.initial = dspic33_read_word(cpu, address);
    dspic33_write_word(cpu, address, 0xffffu);
    difference.ones = dspic33_read_word(cpu, address);
    prepare_register(cpu, selector_address, selector_mask, selector_value);
    dspic33_write_word(cpu, address, 0u);
    difference.zeroes = dspic33_read_word(cpu, address);
    prepare_register(cpu, selector_address, selector_mask, selector_value);
    dspic33_write_word(cpu, address,
                       (uint16_t)(UINT16_MAX & ~dependent_read_only_mask));
    difference.ones_without_dependent = dspic33_read_word(cpu, address);
    prepare_register(cpu, selector_address, selector_mask, selector_value);
    dspic33_write_word(cpu, address, dependent_read_only_mask);
    difference.zeroes_with_dependent = dspic33_read_word(cpu, address);
    difference.normal =
        (uint16_t)(((uint16_t)~difference.ones | difference.zeroes) & normal_mask);
    difference.read_only =
        (uint16_t)((((difference.ones ^ difference.initial) |
                     (difference.zeroes ^ difference.initial)) &
                    read_only_mask & ~dependent_read_only_mask) |
                   (((difference.ones ^ difference.ones_without_dependent) |
                     (difference.zeroes ^ difference.zeroes_with_dependent)) &
                    dependent_read_only_mask));
    difference.reserved =
        (uint16_t)((difference.initial | difference.ones | difference.zeroes) &
                   reserved_mask);
    difference.write_only =
        (uint16_t)((difference.initial | difference.ones | difference.zeroes) &
                   write_only_mask);
    return difference;
}

static void record_access(SfrAccessCensus* census,
                          const SfrAccessDifference* difference) {
    census->normal_addresses += difference->normal != 0u;
    census->normal_bits += bit_count(difference->normal);
    census->read_only_addresses += difference->read_only != 0u;
    census->read_only_bits += bit_count(difference->read_only);
    census->reserved_addresses += difference->reserved != 0u;
    census->reserved_bits += bit_count(difference->reserved);
    census->write_only_addresses += difference->write_only != 0u;
    census->write_only_bits += bit_count(difference->write_only);
    census->unresolved_addresses += access_is_unresolved(difference);
}

static void inspect_register(SfrAccessCensus* census, Dspic33* cpu,
                             const Dspic33SfrAccessExpectation* expectation) {
    census->aliases += expectation->aliases;
    census->mux_defaults += (expectation->flags & DSPIC33_SFR_ACCESS_MUX_DEFAULT) != 0u;
    census->dependent_read_only_bits += bit_count(expectation->dependent_read_only);
    if ((expectation->flags & DSPIC33_SFR_ACCESS_CONDITIONAL) != 0u) {
        return;
    }
    SfrAccessDifference difference = inspect_access(
        cpu, expectation->address, expectation->normal, expectation->read_only,
        expectation->reserved, expectation->write_only,
        expectation->dependent_read_only, 0u, 0u, 0u);
    record_access(census, &difference);
    if (access_is_unresolved(&difference)) {
        printf("[sfr-access-unresolved] address=0x%04x initial=0x%04x "
               "ones=0x%04x zeroes=0x%04x normal=0x%04x "
               "read-only=0x%04x reserved=0x%04x write-only=0x%04x "
               "flags=0x%02x aliases=%u\n",
               (unsigned)expectation->address, (unsigned)difference.initial,
               (unsigned)difference.ones, (unsigned)difference.zeroes,
               (unsigned)difference.normal, (unsigned)difference.read_only,
               (unsigned)difference.reserved, (unsigned)difference.write_only,
               (unsigned)expectation->flags, (unsigned)expectation->aliases);
    }
}

static void inspect_mux_register(SfrMuxCensus* census, Dspic33* cpu,
                                 const Dspic33SfrMuxAccessExpectation* expectation) {
    uint16_t selector_reset;
    uint16_t selector_switch;
    SfrAccessDifference difference;
    bool unresolved;
    dspic33_reset(cpu, 0u);
    selector_reset = (uint16_t)((dspic33_read_word(cpu, expectation->selector_address) ^
                                 expectation->selector_reset) &
                                expectation->selector_mask);
    select_register(cpu, expectation->selector_address, expectation->selector_mask,
                    expectation->selector_value);
    selector_switch =
        (uint16_t)((dspic33_read_word(cpu, expectation->selector_address) ^
                    expectation->selector_value) &
                   expectation->selector_mask);
    difference = inspect_access(
        cpu, expectation->address, expectation->normal, expectation->read_only,
        expectation->reserved, expectation->write_only,
        expectation->dependent_read_only, expectation->selector_address,
        expectation->selector_mask, expectation->selector_value);
    unresolved = selector_reset != 0u || selector_switch != 0u ||
                 access_is_unresolved(&difference);
    census->addresses++;
    census->unresolved_addresses += unresolved;
    census->selector_reset_addresses += selector_reset != 0u;
    census->selector_reset_bits += bit_count(selector_reset);
    census->selector_switch_addresses += selector_switch != 0u;
    census->selector_switch_bits += bit_count(selector_switch);
    record_access(&census->access, &difference);
    if (unresolved) {
        printf("[sfr-mux-unresolved] address=0x%04x selector=0x%04x "
               "selector-reset=0x%04x selector-switch=0x%04x "
               "initial=0x%04x ones=0x%04x zeroes=0x%04x normal=0x%04x "
               "read-only=0x%04x reserved=0x%04x write-only=0x%04x\n",
               (unsigned)expectation->address, (unsigned)expectation->selector_address,
               (unsigned)selector_reset, (unsigned)selector_switch,
               (unsigned)difference.initial, (unsigned)difference.ones,
               (unsigned)difference.zeroes, (unsigned)difference.normal,
               (unsigned)difference.read_only, (unsigned)difference.reserved,
               (unsigned)difference.write_only);
    }
}

static void inspect_conditional_register(
    SfrConditionalCensus* census, Dspic33* cpu,
    const Dspic33SfrConditionalAccessExpectation* expectation) {
    SfrAccessDifference difference = inspect_access(
        cpu, expectation->address, expectation->normal, expectation->read_only,
        expectation->reserved, expectation->write_only,
        expectation->dependent_read_only, expectation->selector_address,
        expectation->selector_mask, expectation->selector_value);
    uint16_t selected_value = (uint16_t)(0xa55au & expectation->normal);
    uint16_t selector_reset;
    uint16_t selector_switch;
    bool absence;
    bool isolation;
    bool unresolved;
    record_access(&census->access, &difference);
    dspic33_reset(cpu, 0u);
    selector_reset = (uint16_t)((dspic33_read_word(cpu, expectation->selector_address) ^
                                 expectation->selector_reset) &
                                expectation->selector_mask);
    select_register(cpu, expectation->selector_address, expectation->selector_mask,
                    expectation->selector_value);
    selector_switch =
        (uint16_t)((dspic33_read_word(cpu, expectation->selector_address) ^
                    expectation->selector_value) &
                   expectation->selector_mask);
    dspic33_write_word(cpu, expectation->address, selected_value);
    isolation = dspic33_read_word(cpu, expectation->address) != selected_value;
    select_register(cpu, expectation->selector_address, expectation->selector_mask,
                    expectation->selector_reset);
    absence = dspic33_read_word(cpu, expectation->address) != 0u;
    dspic33_write_word(cpu, expectation->address, 0xffffu);
    absence = absence || dspic33_read_word(cpu, expectation->address) != 0u;
    select_register(cpu, expectation->selector_address, expectation->selector_mask,
                    expectation->selector_value);
    isolation =
        isolation || dspic33_read_word(cpu, expectation->address) != selected_value;
    unresolved = selector_reset != 0u || selector_switch != 0u || absence ||
                 isolation || access_is_unresolved(&difference);
    census->addresses++;
    census->unresolved_addresses += unresolved;
    census->selector_reset_addresses += selector_reset != 0u;
    census->selector_reset_bits += bit_count(selector_reset);
    census->selector_switch_addresses += selector_switch != 0u;
    census->selector_switch_bits += bit_count(selector_switch);
    census->absence_addresses += absence;
    census->isolation_addresses += isolation;
    if (unresolved) {
        printf("[sfr-conditional-unresolved] address=0x%04x selector=0x%04x "
               "selector-reset=0x%04x selector-switch=0x%04x absence=%u "
               "isolation=%u normal=0x%04x read-only=0x%04x reserved=0x%04x "
               "write-only=0x%04x\n",
               (unsigned)expectation->address, (unsigned)expectation->selector_address,
               (unsigned)selector_reset, (unsigned)selector_switch, absence ? 1u : 0u,
               isolation ? 1u : 0u, (unsigned)difference.normal,
               (unsigned)difference.read_only, (unsigned)difference.reserved,
               (unsigned)difference.write_only);
    }
}

static uint16_t
dependent_normal_request(Dspic33* cpu,
                         const Dspic33SfrDependentNormalExpectation* expectation,
                         uint16_t selector_value, uint16_t value) {
    if (expectation->address != expectation->selector_address) {
        return value;
    }
    return (uint16_t)((dspic33_read_word(cpu, expectation->address) &
                       ~(expectation->selector_mask | expectation->mask)) |
                      selector_value | value);
}

static void inspect_dependent_normal_register(
    SfrDependentNormalCensus* census, Dspic33* cpu,
    const Dspic33SfrDependentNormalExpectation* expectation) {
    uint16_t normal;
    uint16_t restricted_read;
    uint16_t restricted_write;
    uint16_t resurrected;
    prepare_register(cpu, expectation->selector_address, expectation->selector_mask,
                     expectation->normal_value);
    dspic33_write_word(cpu, expectation->address,
                       dependent_normal_request(cpu, expectation,
                                                expectation->normal_value,
                                                expectation->mask));
    normal =
        (uint16_t)(dspic33_read_word(cpu, expectation->address) & expectation->mask);
    select_register(cpu, expectation->selector_address, expectation->selector_mask,
                    expectation->restricted_value);
    restricted_read =
        (uint16_t)(dspic33_read_word(cpu, expectation->address) & expectation->mask);
    dspic33_write_word(cpu, expectation->address,
                       dependent_normal_request(cpu, expectation,
                                                expectation->restricted_value,
                                                expectation->mask));
    restricted_write =
        (uint16_t)(dspic33_read_word(cpu, expectation->address) & expectation->mask);
    select_register(cpu, expectation->selector_address, expectation->selector_mask,
                    expectation->normal_value);
    resurrected =
        (uint16_t)(dspic33_read_word(cpu, expectation->address) & expectation->mask);
    census->addresses++;
    census->normal_write_failures += normal != expectation->mask;
    census->restricted_read_failures += restricted_read != 0u;
    census->restricted_write_failures += restricted_write != 0u;
    census->resurrection_failures += resurrected != 0u;
    census->failures += normal != expectation->mask || restricted_read != 0u ||
                        restricted_write != 0u || resurrected != 0u;
    if (normal != expectation->mask || restricted_read != 0u ||
        restricted_write != 0u || resurrected != 0u) {
        printf("[sfr-dependent-normal-failed] address=0x%04x normal=0x%04x "
               "restricted-read=0x%04x restricted-write=0x%04x "
               "resurrected=0x%04x\n",
               (unsigned)expectation->address, (unsigned)normal,
               (unsigned)restricted_read, (unsigned)restricted_write,
               (unsigned)resurrected);
    }
}

