tylertms/dspic33e-sim/conformance/sfr_access.c
static void print_inventory(const SfrAccessCensus* census) {
    printf(
        "[sfr-access-inventory] definitions=%u addresses=%u aliases=%" PRIu32
        " mux-defaults=%" PRIu32 " mux-alternates=%u normal-bits=%u "
        "read-only-bits=%u reserved-bits=%u write-only-bits=%u "
        "side-effect-bits=%u split-access-addresses=%u split-access-bits=%u "
        "dependent-normal-addresses=%u dependent-normal-bits=%u "
        "alternate-normal-bits=%u "
        "alternate-read-only-bits=%u alternate-reserved-bits=%u "
        "alternate-write-only-bits=%u alternate-side-effect-bits=%u\n",
        DSPIC33_SFR_ACCESS_DEFINITION_COUNT, DSPIC33_SFR_ACCESS_ADDRESS_COUNT,
        census->aliases, census->mux_defaults, DSPIC33_SFR_ACCESS_MUX_ALTERNATE_COUNT,
        DSPIC33_SFR_ACCESS_NORMAL_BIT_COUNT, DSPIC33_SFR_ACCESS_READ_ONLY_BIT_COUNT,
        DSPIC33_SFR_ACCESS_RESERVED_BIT_COUNT, DSPIC33_SFR_ACCESS_WRITE_ONLY_BIT_COUNT,
        DSPIC33_SFR_ACCESS_SIDE_EFFECT_BIT_COUNT,
        DSPIC33_SFR_ACCESS_SPLIT_ACCESS_ADDRESS_COUNT,
        DSPIC33_SFR_ACCESS_SPLIT_ACCESS_BIT_COUNT,
        DSPIC33_SFR_ACCESS_DEPENDENT_NORMAL_ADDRESS_COUNT,
        DSPIC33_SFR_ACCESS_DEPENDENT_NORMAL_BIT_COUNT,
        DSPIC33_SFR_MUX_ACCESS_NORMAL_BIT_COUNT,
        DSPIC33_SFR_MUX_ACCESS_READ_ONLY_BIT_COUNT,
        DSPIC33_SFR_MUX_ACCESS_RESERVED_BIT_COUNT,
        DSPIC33_SFR_MUX_ACCESS_WRITE_ONLY_BIT_COUNT,
        DSPIC33_SFR_MUX_ACCESS_SIDE_EFFECT_BIT_COUNT);
}

static void print_access_summary(const SfrAccessCensus* census) {
    printf("[sfr-access-summary] unresolved-addresses=%" PRIu32
           " normal-addresses=%" PRIu32 " normal-bits=%" PRIu32
           " read-only-addresses=%" PRIu32 " read-only-bits=%" PRIu32
           " reserved-addresses=%" PRIu32 " reserved-bits=%" PRIu32
           " write-only-addresses=%" PRIu32 " write-only-bits=%" PRIu32 "\n",
           census->unresolved_addresses, census->normal_addresses, census->normal_bits,
           census->read_only_addresses, census->read_only_bits,
           census->reserved_addresses, census->reserved_bits,
           census->write_only_addresses, census->write_only_bits);
}

static void print_mux_summary(const SfrMuxCensus* census) {
    printf("[sfr-mux-summary] addresses=%" PRIu32 " unresolved-addresses=%" PRIu32
           " selector-reset-addresses=%" PRIu32 " selector-reset-bits=%" PRIu32
           " selector-switch-addresses=%" PRIu32 " selector-switch-bits=%" PRIu32
           " alternate-unresolved-addresses=%" PRIu32
           " alternate-normal-addresses=%" PRIu32 " alternate-normal-bits=%" PRIu32
           " alternate-read-only-addresses=%" PRIu32
           " alternate-read-only-bits=%" PRIu32 " alternate-reserved-addresses=%" PRIu32
           " alternate-reserved-bits=%" PRIu32
           " alternate-write-only-addresses=%" PRIu32
           " alternate-write-only-bits=%" PRIu32 "\n",
           census->addresses, census->unresolved_addresses,
           census->selector_reset_addresses, census->selector_reset_bits,
           census->selector_switch_addresses, census->selector_switch_bits,
           census->access.unresolved_addresses, census->access.normal_addresses,
           census->access.normal_bits, census->access.read_only_addresses,
           census->access.read_only_bits, census->access.reserved_addresses,
           census->access.reserved_bits, census->access.write_only_addresses,
           census->access.write_only_bits);
}

static void print_conditional_summary(const SfrConditionalCensus* census) {
    printf("[sfr-conditional-summary] addresses=%" PRIu32
           " normal-bits=%u read-only-bits=%u reserved-bits=%u write-only-bits=%u "
           "side-effect-bits=%u unresolved-addresses=%" PRIu32
           " selector-reset-addresses=%" PRIu32 " selector-reset-bits=%" PRIu32
           " selector-switch-addresses=%" PRIu32 " selector-switch-bits=%" PRIu32
           " absence-addresses=%" PRIu32 " isolation-addresses=%" PRIu32
           " access-unresolved-addresses=%" PRIu32 " access-normal-bits=%" PRIu32
           " access-read-only-bits=%" PRIu32 " access-reserved-bits=%" PRIu32
           " access-write-only-bits=%" PRIu32 "\n",
           census->addresses, DSPIC33_SFR_CONDITIONAL_ACCESS_NORMAL_BIT_COUNT,
           DSPIC33_SFR_CONDITIONAL_ACCESS_READ_ONLY_BIT_COUNT,
           DSPIC33_SFR_CONDITIONAL_ACCESS_RESERVED_BIT_COUNT,
           DSPIC33_SFR_CONDITIONAL_ACCESS_WRITE_ONLY_BIT_COUNT,
           DSPIC33_SFR_CONDITIONAL_ACCESS_SIDE_EFFECT_BIT_COUNT,
           census->unresolved_addresses, census->selector_reset_addresses,
           census->selector_reset_bits, census->selector_switch_addresses,
           census->selector_switch_bits, census->absence_addresses,
           census->isolation_addresses, census->access.unresolved_addresses,
           census->access.normal_bits, census->access.read_only_bits,
           census->access.reserved_bits, census->access.write_only_bits);
}

static void print_dependent_normal_summary(const SfrDependentNormalCensus* census) {
    printf("[sfr-dependent-normal-summary] addresses=%" PRIu32
           " normal-write-failures=%" PRIu32 " restricted-read-failures=%" PRIu32
           " restricted-write-failures=%" PRIu32 " resurrection-failures=%" PRIu32
           " failures=%" PRIu32 "\n",
           census->addresses, census->normal_write_failures,
           census->restricted_read_failures, census->restricted_write_failures,
           census->resurrection_failures, census->failures);
}

static void print_map_summary(const SfrMapCensus* census) {
    printf("[sfr-map-summary] words=%u implemented=%" PRIu32 " absent=%" PRIu32
           " absent-ranges=%" PRIu32 " direct-byte-checks=%" PRIu32
           " direct-word-checks=%" PRIu32 " internal-pad-byte-checks=%" PRIu32
           " internal-pad-word-checks=%" PRIu32 " odd-crossing-checks=%" PRIu32
           " lifecycle-checks=%" PRIu32 " failures=%" PRIu32 "\n",
           DSPIC33_SFR_WORD_COUNT, census->implemented_words, census->absent_words,
           census->absent_ranges, census->direct_byte_checks,
           census->direct_word_checks, census->internal_pad_byte_checks,
           census->internal_pad_word_checks, census->odd_crossing_checks,
           census->lifecycle_checks, census->failures);
}

int main(void) {
    Dspic33 cpu;
    SfrAccessCensus census = {0u};
    SfrMuxCensus mux_census = {0u};
    SfrConditionalCensus conditional_census = {0u};
    SfrDependentNormalCensus dependent_normal_census = {0u};
    SfrMapCensus map_census;
    uint32_t index;
    _Static_assert(sizeof(dspic33_sfr_access_expectations) /
                           sizeof(dspic33_sfr_access_expectations[0]) ==
                       DSPIC33_SFR_ACCESS_ADDRESS_COUNT,
                   "SFR access expectation count");
    _Static_assert(sizeof(dspic33_sfr_mux_access_expectations) /
                           sizeof(dspic33_sfr_mux_access_expectations[0]) ==
                       DSPIC33_SFR_ACCESS_MUX_ALTERNATE_COUNT,
                   "SFR mux access expectation count");
    _Static_assert(sizeof(dspic33_sfr_split_access_expectations) /
                           sizeof(dspic33_sfr_split_access_expectations[0]) ==
                       DSPIC33_SFR_ACCESS_SPLIT_ACCESS_ADDRESS_COUNT,
                   "SFR split access expectation count");
    _Static_assert(sizeof(dspic33_sfr_dependent_normal_expectations) /
                           sizeof(dspic33_sfr_dependent_normal_expectations[0]) ==
                       DSPIC33_SFR_ACCESS_DEPENDENT_NORMAL_ADDRESS_COUNT,
                   "SFR dependent normal expectation count");
    _Static_assert(sizeof(dspic33_sfr_conditional_access_expectations) /
                           sizeof(dspic33_sfr_conditional_access_expectations[0]) ==
                       DSPIC33_SFR_ACCESS_CONDITIONAL_COUNT,
                   "SFR conditional access expectation count");
    _Static_assert(sizeof(dspic33_sfr_implementation_bitmap) ==
                       DSPIC33_SFR_IMPLEMENTATION_BITMAP_SIZE,
                   "SFR implementation bitmap size");
    if (!dspic33_initialize(&cpu)) {
        fprintf(stderr, "failed to initialize simulator\n");
        return 2;
    }
    for (index = 0u; index < DSPIC33_SFR_ACCESS_ADDRESS_COUNT; index++) {
        inspect_register(&census, &cpu, &dspic33_sfr_access_expectations[index]);
    }
    for (index = 0u; index < DSPIC33_SFR_ACCESS_MUX_ALTERNATE_COUNT; index++) {
        inspect_mux_register(&mux_census, &cpu,
                             &dspic33_sfr_mux_access_expectations[index]);
    }
    for (index = 0u; index < DSPIC33_SFR_ACCESS_CONDITIONAL_COUNT; index++) {
        inspect_conditional_register(
            &conditional_census, &cpu,
            &dspic33_sfr_conditional_access_expectations[index]);
    }
    for (index = 0u; index < DSPIC33_SFR_ACCESS_DEPENDENT_NORMAL_ADDRESS_COUNT;
         index++) {
        inspect_dependent_normal_register(
            &dependent_normal_census, &cpu,
            &dspic33_sfr_dependent_normal_expectations[index]);
    }
    map_census = inspect_sfr_map(&cpu);
    dspic33_destroy(&cpu);
    print_inventory(&census);
    print_access_summary(&census);
    print_mux_summary(&mux_census);
    print_conditional_summary(&conditional_census);
    print_dependent_normal_summary(&dependent_normal_census);
    print_map_summary(&map_census);
    if (census.aliases != DSPIC33_SFR_ACCESS_ALIAS_COUNT ||
        census.mux_defaults != DSPIC33_SFR_ACCESS_MUX_DEFAULT_COUNT ||
        census.dependent_read_only_bits !=
            DSPIC33_SFR_ACCESS_DEPENDENT_READ_ONLY_BIT_COUNT ||
        mux_census.addresses != DSPIC33_SFR_ACCESS_MUX_ALTERNATE_COUNT ||
        conditional_census.addresses != DSPIC33_SFR_ACCESS_CONDITIONAL_COUNT ||
        dependent_normal_census.addresses !=
            DSPIC33_SFR_ACCESS_DEPENDENT_NORMAL_ADDRESS_COUNT) {
        return 2;
    }
    return census.unresolved_addresses == 0u && mux_census.unresolved_addresses == 0u &&
                   conditional_census.unresolved_addresses == 0u &&
                   dependent_normal_census.failures == 0u && map_census.failures == 0u
               ? 0
               : 1;
}
